workstation/tutorials/multiphase/icoReactingMultiphaseInterFoam/solidMelting2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)           Gauss linear;

    "div\(alphaPhi.*,Yi\)"  Gauss linear;

    "div\(phi,alpha.*\)"    Gauss vanLeer;
    "div\(phir,alpha.*\)"   Gauss linear;

    DDt(phi,alpha)          Gauss vanLeer;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    div(phi,T) Gauss linear;

    div(HbyA)               Gauss linear;

}

laplacianSchemes
{
    default             Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
    p_rgh             ;
    "alpha.*"         ;
}


// ************************************************************************* //
